run_3D/template/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(INLET|BOTTOM)"
    {
        type            zeroGradient;
    }

    "(OUTLET|TOP)"
    {
        type            fixedValue;
        value           $internalField;
    }

    Wing.stl
    {
        type            zeroGradient;
    }

    SYMMETRY
    {
        type            symmetryPlane;
    }

    WALL
    {
        type            slip;
    }
}

// ************************************************************************* //
