run_3D/template/system/forceCoefficient
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is incompressible (pressure
    is kinematic, e.g. m^2/s^2).
\*---------------------------------------------------------------------------*/

type              forceCoeffs;
libs              ("libforces.so");
patches           ( Wing.stl );
log               yes;
rho               rhoInf;      // Indicates incompressible
rhoInf            1.225;      // Redundant for incompressible
liftDir           (0 1 0);
dragDir           (1 0 0);
CofR              (0 0 0);    // Centre of rotation for moment calculations
pitchAxis         (0 0 1);
magUInf           23;
lRef              0.135;
Aref              0.1125;

// ************************************************************************* //